#تتعامل ويا الشبكات
#تسوي اتصال بين جهازك وأي جهاز ثاني
#نستعملimport في استدعاء مكتبة socket للتعامل مع الشبكة والمنافذ 
import socket

# الهدف: ضع هنا عنوان الـ IP للجهاز الذي تريد فحص منافذه
V = "192.168.0.1"  # مثال: جهازك أو الراوتر

# قائمة المنافذ الشائعة للفحص
ports = [21, 22, 23, 80, 443, 8080, 53]

# إخراج رسالة للمستخدم بأن الفحص جاري
print(f"Ports are being inspected...  : {V}")

# حلقة تمر على كل منفذ في القائمة
for port in ports:
  #انشاء اتصال 
  # إنشاء كائن socket
    sock = socket.socket(socket.AF_INET, socket.SOCK_STREAM)
    
    # ضبط وقت المهلة (1 ثانية) لتجنب الانتظار الطويل
    sock.settimeout(1)
    
   #يعمل اتصال بين portو ip=v 
    # محاولة الاتصال بالمنفذ، إذا النتيجة 0 = المنفذ مفتوح
    result = sock.connect_ex((V, port))
    
    #عرض النتيجة 
    if result == 0:
        print(f"[✔] المنفذ مفتوح: {port}")
    else:
        print(f"[✘] المنفذ مغلق: {port}")
    
    # إغلاق الاتصال بالمنفذ
    sock.close()